{
    "2020-03-01": [
        "FA Cup 2020: 5th-Round TV Schedule, Live Stream, Odds and Predictions",
        "VAR disallows Everton winner as Man United grind out a draw",
        "VAR rules out late Everton winner as Man United snatch draw",
        "How U.S. soccer players fared abroad this weekend",
        "Rangers: 'Serious question marks' over mentality - Steven Thompson",
        "Defoe: We let Gerrard down but he's the man for Rangers",
        "How U.S. soccer players fared abroad this weekend",
        "The facts about coronavirus: What you need to know",
        "Tottenham vs Wolves LIVE: Team news, line-ups and more ahead of Premier League fixture today",
        "Matt Doherty scores again as Wolves keep on rolling",
        "How U.S. soccer players fared abroad this weekend",
        "Small miners hungry for fresh capital despite rampant EV enthusiasm",
        "Uruguay ushers in first conservative government in 15 years",
        "Rise in Irish companies hiring foreign workers to meet skills shortages",
        "Garth Crooks' team of the week: Fernandes, Alonso, Foden, Maguire, Deeney",
        "Ireland duo provisionally secure Olympic spot in Berlin",
        "Rangers: 'Serious question marks' over mentality - Steven Thompson",
        "Jimenez winner at Tottenham sends Wolves sixth",
        "Small miners hungry for fresh capital despite rampant EV enthusiasm",
        "Mark Downey and Felix English secure Olympic qualification",
        "Equestrian: Ireland take second for third year in a row at Nations Cup",
        "How U.S. soccer players fared abroad this weekend",
        "Tottenham 2-3 Wolves: Our 'energy' the key to beating Spurs - Nuno",
        "More chaos for Serie A after new decree on virus measures",
        "La Liga Winners and Losers After Final 2020 Week 26 Table",
        "Serie A, soccer clubs clash in Italy amid coronavirus chaos",
        "Wolves beat Tottenham to help push for Champions League spot",
        "Probable line-ups: Cagliari vs Roma",
        "Man City keeps winning trophies amid bigger off-field fight",
        "Garth Crooks' team of the week: Fernandes, Alonso, Foden, Maguire, Deeney",
        "Ancelotti shown red card after game as Everton denied late winner over Man Utd",
        "Rangers: 'Serious question marks' over mentality - Steven Thompson",
        "Official: Sampdoria-Verona behind closed doors",
        "Fonseca: 'Roma suffered too much'",
        "Jimenez winner at Tottenham sends Wolves sixth",
        "St Johnstone 0-1 Celtic: Late Ryan Christie goal sends holders to Scottish Cup semi-finals",
        "Marotta: 'Risk not concluding Serie A season'",
        "Line-ups: Cagliari v Roma",
        "Barone: 'Either we all play, or nobody does'",
        "Serie A, soccer clubs clash in Italy amid coronavirus outbreak",
        "Celtic get Aberdeen in semis after battling success",
        "Defoe: We let Gerrard down but he's the man for Rangers"
    ],
    "2020-03-02": [
        "Portugal registers first two cases of coronavirus: SIC television",
        "Manchester United Reportedly Set to Hire Data Specialists to Aid Recruitment",
        "Gulf, Southeast Asia, Europe soon to have new Indian envoys",
        "Portugal registers first two cases of coronavirus: health minister",
        "The one true sign that Wolves really do belong as Champions League contenders",
        "Rangers v Hamilton Accies: 'Pressure is where we are', Brian Rice tells Steven Gerrard",
        "Scottish Gossip: Rangers, Celtic, Gerrard, Edouard, Leicester, St Johnstone, Hagi, Genk, Hamilton",
        "Portugal registers first two cases of coronavirus: SIC television",
        "Transfer rumours: Sancho, Werner, Holgate, Lozano, Pogba, Sturridge",
        "Kazan calling: Russian city confirmed as hosts of 2023 UEFA Super Cup final",
        "Portugal registers first two cases of coronavirus: health minister",
        "Father arrested for death of teenage daughter",
        "Portugal registers first two cases of coronavirus: SIC television",
        "Nations League: Everything you need to know about Tuesday's draw",
        "When is the Uefa Nations League draw, where can I watch it and who can England play?",
        "Kazan calling: Russian city confirmed as hosts of 2023 UEFA Super Cup final",
        "Coronavirus: World in 'uncharted territory'",
        "Alcohol: Wales minimum pricing law comes into force",
        "'Ronaldo wants Real return'",
        "Rangers v Hamilton Accies: 'Pressure is where we are', Brian Rice tells Steven Gerrard",
        "Half of the world's beaches could disappear by the end of the century, study finds",
        "Ireland return to camp despite coronavirus fears",
        "Coronavirus Update, Map as Death Toll Passes 3,000, Outbreak Spreads to Over 60 Countries",
        "Virus reaches new countries as crisis seems to ease in China",
        "Portugal registers first two cases of coronavirus: health minister",
        "The Offload: the secret is out about Ryan Baird",
        "Historian: Vatican Archives Will Debunk ‘Fake News’ of Pius XII’s Supposed Silence",
        "‘Combs Are for P*ssies’: Sarah Silverman, Dick Van Dyke Rally 17,000 for Bernie Sanders in L.A.",
        "Ryan Baird joins up with Ireland squad for training",
        "Coronavirus: 6 Deaths Total Confirmed in U.S.",
        "FA Cup 2020: 5th-Round Results, Scores, Updated Schedule After Monday's Fixtures",
        "UEFA picks $670M stadium in Budapest for 2022 Europa final",
        "AI and sleep disorders: enhancing diagnosis and treatment - Health Europa",
        "Arsenal overcomes Portsmouth 2-0 to reach FA Cup 6th round",
        "EPL Week 29 Predictions: Premier League Picks, Key Players and Fixtures",
        "Kazan calling: Russian city confirmed as hosts of 2023 UEFA Super Cup final",
        "UEFA seeks to dampen Euro 2020 panic over virus outbreak",
        "Milan residents banned from semifinal match at Juventus",
        "The one true sign that Wolves really do belong as Champions League contenders",
        "Rangers v Hamilton Accies: 'Pressure is where we are', Brian Rice tells Steven Gerrard",
        "Mikel Arteta Talks Arsenal Transfer Plans Amid 'Enormous' Impact of No UCL",
        "Scottish Gossip: Rangers, Celtic, Gerrard, Edouard, Leicester, St Johnstone, Hagi, Genk, Hamilton",
        "Juventus Stadium awarded 2022 women's Champions League",
        "FA Cup fifth-round predictions: Lawro v Hot Property star Yung Filly",
        "Arsenal news: Mikel Arteta admits club will struggle to attract top players without Champions League spot",
        "Portsmouth vs Arsenal result: Eddie Nketiah wraps up victory to send Gunners into FA Cup quarter-finals",
        "Cellino: '20 teams in Serie A, not just two'",
        "UEFA picks $670M stadium in Budapest for 2022 Europa final",
        "Marotta: 'Almost provocative'",
        "Christian Doidge: From police force to Hibs strike force for Welsh late developer"
    ],
    "2020-03-03": [
        "Cristiano Ronaldo 'jets in to Portugal to be with mother Dolores after she suffers stroke'",
        "Peter Schmeichel Backing Ole Gunnar Solskjaer's Manchester United 'Grand Plan'",
        "Cristiano Ronaldo 'jets in to Portugal to be with mother Dolores after she suffers stroke'",
        "Ronaldo says his mother is in 'stable' condition in hospital",
        "Dolores Aveiro, Cristiano Ronaldo's mother, suffers a stroke",
        "Ronaldo says his mother is in 'stable' condition in hospital",
        "Cristiano Ronaldo Says Mom Dolores Is in Stable Condition After Hospitalization",
        "Portugal grouped with France in Nations League title defense",
        "Pedro Costa, Filming the Saga of Lisbon’s Cabo Verdeans",
        "Cristiano Ronaldo 'jets in to Portugal to be with mother Dolores after she suffers stroke'",
        "Ronaldo says his mother is in 'stable' condition in hospital",
        "EU states call for speedy 2030 climate plan ahead of U.N. climate summit: letter",
        "Climate Change Will Turn These Common Foods Toxic",
        "Guinea-Bissau Supreme Court accuses army of occupying courts",
        "She Believes Cup: England v USA - who are Lionesses' new faces?",
        "Meet Europe’s top 100 scaleups at Tech5 Founders Day",
        "Nations League: Italy with Holland, Bosnia, Poland",
        "Ronaldo reportedly travels to be with ill mother",
        "Mapping mythology, history and art with Wendell Rodricks",
        "Coronavirus update: Iran on high alert and WHO raises concerns over medical supply shortage",
        "Nations League: Who could Scotland face and what's at stake this time?",
        "Coronavirus: New European cases soar as China infections and deaths drop",
        "Here's how the UEFA Nations League draw is shaping up",
        "Coronavirus update: Limits placed on toilet paper purchases as new cases of COVID-19 confirmed in Australia",
        "Portugal grouped with France in Nations League title defense",
        "Sarri: 'Juve plans change with Ronaldo'",
        "Arsenal advances to F.A. Cup quarterfinals",
        "Spain: Games against Italian teams to be played without fans",
        "David Luiz Says Pablo Mari 'Had an Amazing Game' in Arsenal Debut vs. Portsmouth",
        "Inter president investigated for insulting league president",
        "Arteta: Arsenal players 'knackered' after Europa exit",
        "Sokratis hints at Arsenal exit after falling out of favour under Mikel Arteta",
        "Hibs 1-3 Hearts: Clare, Bozanic & Washington net in Edinburgh derby win",
        "Hammered in Europe and on shaky ground in the league… How safe is Frank Lampard from ruthless Roman Abramovich?",
        "Inter betting it all on a long shot",
        "Hibernian 1-3 Hearts: Daniel Stendel 'very proud' of Tynecastle team",
        "Mikel Arteta forced into fielding youthful FA Cup side due to Arsenal's Europa League hangover",
        "Cagliari sack Maran",
        "Spain want Italian teams behind closed doors",
        "UEFA 'optimistic' Euro 2020 to go ahead as planned",
        "Rangers: Steven Gerrard says he is still 'all in' as manager",
        "Malago: 'Presidents talking like the fans'",
        "Valencia vs Atalanta and Getafe vs Inter to be played behind closed doors",
        "'For now it is business as usual' - football authorities hold coronavirus talks",
        "Pioli: 'Milan must believe in Coppa'",
        "UEFA 'confident' coronavirus outbreak will not derail Euro 2020 plans"
    ],
    "2020-03-04": [
        "Ryan Giggs: Bruno Fernandes Has 'Lifted Everyone' at Manchester United",
        "Portugal raids soccer clubs, agents in tax investigation",
        "Ole Gunnar Solskjaer Talks Bruno Fernandes' 'Aura,' Manchester United Boost",
        "Can-Am Crown, basilica declaration, landfill park: News from around our 50 states",
        "Portugal raids soccer clubs, agents in tax investigation",
        "Here's what $1 million buys you in real estate around the world",
        "Eurogroup's Centeno: 'No efforts will be spared' to contain coronavirus outbreak",
        "Rangers: Steven Gerrard says side 'shot of confidence and in rut'",
        "All you need to know: Republic of Ireland v Greece",
        "Casillas: The Portuguese tax agency came to my house, like they did with 76 others",
        "The disappointing signings of LaLiga Santander",
        "Who is the number two coach at each LaLiga Santander club?",
        "Cristiano Ronaldo returns to Juventus training day after dash to Portugal to visit mother in hospital",
        "Portugal raids soccer clubs, agents in tax investigation",
        "Cristiano Ronaldo returns to Juventus training day after dash to Portugal to visit mother in hospital",
        "Ryan Giggs: Bruno Fernandes Has 'Lifted Everyone' at Manchester United",
        "Cristiano Ronaldo says his mother is in 'stable' condition in hospital",
        "Portugal raids soccer clubs, agents in tax investigation",
        "Ole Gunnar Solskjaer Talks Bruno Fernandes' 'Aura,' Manchester United Boost",
        "Passenger £1,000 out of pocket and barred from flights due to novelty passport stamp",
        "Inter Milan president backs calls for empty stadiums in Italy over coronavirus fears",
        "Coronavirus: Serie A games may be played behind closed doors - Italy's sports minister",
        "COVID-19 | Spain reports first coronavirus death in Valencia",
        "Wayne Rooney: \"Obviously I want Man United to lose\" – Derby striker speaks ahead of FA Cup tie",
        "Champions League, Davis Cup and Six Nations set to be played in empty arenas in Italy",
        "Champions and Europa League behind closed doors in Italy",
        "COVID-19 | List of global sports events affected due to coronavirus outbreak",
        "Valencia fans allowed in with Atalanta?",
        "Spain to close the doors on Italian teams?",
        "Celtic: Livingston match not a revenge mission, says Scott Brown",
        "Rangers: Steven Gerrard says side 'shot of confidence and in rut'",
        "Rooney only had eyes for Man United FA Cup reunion",
        "Coronavirus advice for players and staff",
        "Tension at Valencia and Getafe over Coronavirus closed doors plan",
        "Valencia vs. Atalanta UCL Match Closed to Fans Amid Coronavirus Concerns",
        "Mirabelli: 'Rangnick will need time'",
        "Ole Gunnar Solskjaer Talks Bruno Fernandes' 'Aura,' Manchester United Boost",
        "Sports minister expects Barcelona vs Napoli to be played with fans",
        "Will it be third time lucky for Atletico Madrid and Rakitic?",
        "Premier League top four run-in: Who has the best and worst fixtures? Chelsea, Manchester United, Tottenham, Wolves?"
    ],
    "2020-03-05": [
        "2019: Greta Thunberg",
        "Portugal's TAP cancels around 1,000 flights in March-April over coronavirus",
        "Fantasy football tips: Players to bring in and drop for gameweek 29",
        "UPDATE 1-Portugal's TAP cancels 1,000 flights in March-April as coronavirus hits demand",
        "Portugal's TAP cancels around 1,000 flights in March-April over coronavirus",
        "Portugal's TAP cancels 1,000 flights in March-April as coronavirus hits demand",
        "Rangers: What has happened to Steven Gerrard's side in 2020?",
        "Diane Caldwell goal secures Ireland win to continue playoff drive",
        "Caldwell goal secures Ireland win to continue playoff drive",
        "Diane Caldwell goal secures Ireland win as they continue playoff drive",
        "Diane Caldwell goal secures Ireland win to continue playoff drive",
        "This little self-driving boat is changing the way we search for shipwrecks",
        "Cristiano Ronaldo's agent Jorge Mendes one of many embroiled in widespread anti-corruption probe",
        "Brazilian soccer star Ronaldinho detained in Paraguay after allegedly using fake passport",
        "ITF women’s tennis tournament | Zeel double bagels Zeina",
        "Monaco's Gelson Martins suspended 6 months for referee shove",
        "ITF women’s tennis tournament | Zeel double bagels Zeina",
        "Brexit-voting ex-pats in Spain wake up to a future of change",
        "SheBelieves Cup: When is it? How to watch? Who will star?",
        "Italy’s Coronavirus Crisis Plunges Broken Economy Into Recession Spiral",
        "UPDATE 1-Portugal's TAP cancels 1,000 flights in March-April as coronavirus hits demand",
        "High-speed train travel between UK and Europe 'saves 60,000 flights a year'",
        "Arsenal injury blow as Lucas Torreira fractures ankle",
        "Giovanni Reyna: 'I Only Want to Play for the USMNT' on International Stage",
        "Monaco's Gelson Martins suspended 6 months for referee shove",
        "Wayne Rooney tells Manchester United fans to show patience in quest to get back to the top",
        "Flybe collapse: Loganair to take over 16 routes",
        "Tall order: Irish rugby unearthing some green giants",
        "Dog leaps off 2,000-foot cliff with owner, parachutes to earth",
        "Portugal's TAP cancels 1,000 flights in March-April as coronavirus hits demand",
        "RPT-COLUMN-The best places to mine are still in the developed world, and that's a problem: Russell",
        "COLUMN-The best places to mine are still in the developed world, and that's a problem: Russell",
        "Coronavirus outbreak: Valencia and Atalanta Champions League second-leg to be played behind closed doors",
        "Pierre-Emerick Aubameyang: Arsenal boss Mikel Arteta wants to keep striker 'under any circumstances'",
        "Ole Gunnar Solskjaer Praises Odion Ighalo, Talks Possible Permanent Transfer",
        "Spanish fans disapprove of stadium closures to stem virus",
        "Marseille faces UEFA punishment for breaking financial rules",
        "Serie A to resume with last weekend's postponed matches",
        "Eric Dier: Evra, Aguero, Cantona - when players have confronted fans",
        "Fantasy football tips: Players to bring in and drop for gameweek 29",
        "UEFA confirm two games to be played behind closed doors",
        "Rangers: What has happened to Steven Gerrard's side in 2020?",
        "Inter-Getafe and Valencia-Atalanta behind closed doors",
        "Serie A Week 25 games moved again",
        "Coppa: Final Four in May?",
        "Rangers: Steven Gerrard still 'right man' for Ibrox job as Kenny Miller criticises duo",
        "Atalanta success not a surprise",
        "Only the Sevilla squad, coaching staff and directors will travel for Roma clash",
        "Manchester United's Odion Ighalo Talks 'Idol' Wayne Rooney: 'He Is a Fighter'",
        "Xbox Game Pass for PC Beta Full List: Which New Games Have Been Added?",
        "Spanish fans disapprove of stadium closures to stem virus",
        "Scottish Premiership: What did we learn from the midweek fixtures?"
    ],
    "2020-03-06": [
        "Transfer rumours: De Bruyne, Sterling, Skriniar, Zidane, Cantwell, Matic",
        "Another victim of coronavirus: Spain's religious statue-kissing",
        "Web Summit organisers make Toronto event an online-only affair",
        "Web Summit organisers make Toronto event an online-only affair due to Coronavirus",
        "'Great Ability' but 'A Bit Lazy': Remembering Jose Mourinho's Playing Days",
        "‘Cosmos: Possible Worlds’ finds hope for humanity in a hopeless era",
        "Bacurau is the best John Carpenter movie Carpenter didn’t actually make",
        "Ronaldinho Won't Be Charged by Paraguayan Authorities over Altered Passport",
        "Sad downfall of $137m star who had it all - Noosa News",
        "Ronaldinho and brother will not face prosecution for fake passports",
        "'Great Ability' but 'A Bit Lazy': Remembering Jose Mourinho's Playing Days",
        "Stephen Malkmus - Traditional Techniques: Pavement singer goes back to basics",
        "The Militao enigma",
        "Monaco's Martins gets six-month ban for referee push",
        "Transfer rumours: De Bruyne, Sterling, Skriniar, Zidane, Cantwell, Matic",
        "Another victim of coronavirus: Spain's religious statue-kissing",
        "Alternative-Rock Legend Stephen Malkmus on His New Folk Album and the Return of His Seminal '90s Band Pavement",
        "'Great Ability' but 'A Bit Lazy': Remembering Jose Mourinho's Playing Days",
        "Coronavirus: China COVID-19 Toll Hits 3,042 As WHO Says Epidemic Not A Drill",
        "'No Danger Of' Barcelona vs. Napoli Being Behind Closed Doors Due to Coronavirus",
        "Mason Greenwood: Manchester United striker breaking records and scoring goals one year on from debut",
        "Denmark to hold Eurovision selection party in empty arena due to coronavirus fears",
        "More sporting events affected by spreading virus",
        "British government to meet with sports bodies about fan bans",
        "Ole Gunnar Solskjaer reveals what pleased him most about Manchester United's FA Cup win at Derby",
        "Bordalas: 'Getafe calm about Milan trip'",
        "UEFA exclude Italian referees",
        "Coronavirus: Meet the football team banned from going back to Wuhan",
        "Rangers: Steven Gerrard aims to arrest form slump and quell fans' anger",
        "Report: Diawara returns to action",
        "Burnley v Tottenham Hotspur",
        "John O'Shea Says Paul Pogba Will Boost Manchester United in Top-4 Race",
        "Ole Gunnar Solskjaer Says 'Fitter' Manchester United 'Have to Go for Everything'",
        "Arsenal vs. West Ham: Odds, Live Stream, TV Schedule and Preview",
        "Arsenal's Pierre-Emerick Aubameyang Plays Down Importance of Trophies",
        "The Coronavirus sporting map: Events cancelled, in doubt or impacted by spread",
        "British government to meet with sports bodies about fan bans",
        "Mikel Arteta Urges Arsenal to Act Soon on Pierre-Emerick Aubameyang Contract",
        "Watch Out for Musa Al-Tamari—The 'Jordanian Messi' Destined for a Big Transfer"
    ],
    "2020-03-07": [
        "Manchester United vs. Manchester City: Derby Odds, Live Stream, TV Schedule",
        "Fintan O’Toole: Covid-19 has come to tell us that we are not the kings of the world",
        "Covid-19 cases top 105,000 worldwide, deaths exceed 3,500",
        "The case for an AI that puts nature and ethics first, not humans",
        "Handcuffed Ronaldinho and brother appear in Paraguayan court",
        "Handcuffed Ronaldinho and brother appear in Paraguayan court",
        "Michael Walker: Anfield set to burn again as Liverpool address unfinished business",
        "Earthquake of magnitude 6.2 strikes Madeira Islands in Portugal: EMSC",
        "Familiarity and flaws provide perfect recipe for a chaotic Manchester derby",
        "Covid-19 cases top 105,000 worldwide, deaths exceed 3,500",
        "Wolves 0-0 Brighton: Nuno says Wolves 'have to improve' for European trip to Olympiakos",
        "Top-4 chasing Wolves frustrated in 0-0 draw with Brighton",
        "Sanctuary Cove and Johnny Bravo may fight it out",
        "AC Milan fires Boban after interview in latest club upheaval",
        "Arsenal vs West Ham LIVE: Team news, line-ups and more ahead of Premier League fixture today",
        "Arsenal vs West Ham prediction: How will Premier League fixture play out today?",
        "Lazio and Atalanta show the way",
        "Michael Walker: Anfield set to burn again as Liverpool address unfinished business",
        "Arsenal vs West Ham predicted line-ups: Team news ahead of Premier League fixture today",
        "Top-4 chasing Wolves frustrated in 0-0 draw with Brighton",
        "AC Milan fires Boban after interview in latest club upheaval",
        "Premier League round-up: Billy Sharp boosts Sheffield United's top four as Brighton edge towards survival",
        "UPDATE 2-Ligue 1 Standings"
    ],
    "2020-03-08": [
        "Man Utd beat Man City to leave Liverpool two wins from title",
        "Man Utd 2-0 Man City: Ole Gunnar Solsjaer is starting to prove doubters wrong",
        "Ronaldo plays his 1,000th match",
        "‘Maintain social distancing’: How does that work in Coppers?",
        "Portugal's president self-isolates amid virus outbreak",
        "Nine U.S. men’s soccer players abroad score goals this weekend",
        "Nine U.S. men’s soccer players abroad score goals this weekend",
        "Militao has played at right-back before",
        "Nine U.S. men’s soccer players abroad score goals this weekend",
        "McCarthy shines at Barroca D'Alva in Portugal",
        "Portugal's president self-isolates amid virus outbreak",
        "Ronaldo plays his 1,000th match",
        "Portugal's president self-isolates amid virus outbreak",
        "Manika Batra sets sight on Olympic qualifiers",
        "Ole Gunnar Solskjaer lauds impact of Bruno Fernandes at Manchester United",
        "Bruno Fernandes lights up Old Trafford as Manchester United secure derby win over City",
        "Nine U.S. men’s soccer players abroad score goals this weekend",
        "Solskjaer hails Fernandes impact at Old Trafford",
        "Man Utd beat Man City to leave Liverpool two wins from title",
        "Coronavirus: Wolves' Europa League tie Olympiakos set to be behind closed doors",
        "Anthony Martial Guides Manchester United Past Manchester City in EPL Derby",
        "Ross County 0-1 Rangers: Jermain Defoe, Ryan Kent & James Tavernier injury blows",
        "Man Utd 2-0 Man City: Ole Gunnar Solsjaer is starting to prove doubters wrong",
        "Johnny Bravo claims Guindy Grand Prix",
        "Scottish Gossip: Rangers, Celtic, Chelsea, Tottenham, Leverkusen, Barisic",
        "Pierre-Emerick Aubameyang Says He's 'Really Happy' at Arsenal amid Exit Rumours",
        "Marotta: 'You move on in life'",
        "Cristiano Ronaldo, Juventus Move to Top of Serie A After Win vs. Inter Milan",
        "Gudelj's suspension creates a problem for Sevilla",
        "Frank Lampard Praises Olivier Giroud After Goal in Chelsea's Win vs. Everton",
        "UPDATE 2-Bundesliga Standings",
        "'We're ambitious' - Doherty on Wolves European quest",
        "No fans, no fun: Athletes uneasy over empty-arena solutions"
    ],
    "2020-03-09": [
        "Portugal's TAP grounds 2,500 more flights due to coronavirus",
        "Portugal's president in 'exemplary' self-isolation, tests negative for coronavirus",
        "Premier League stats: Ole Gunnar Solskjaer marks 50th Man Utd game in style",
        "Ronaldo on 1000th: 'I'm so proud'",
        "Emre Can Says He Snubbed Manchester United for Borussia Dortmund in January",
        "15 things to do in the D.C. area this week",
        "Madonna Cancels Remaining Paris Gigs Over Coronavirus",
        "Jailed Ronaldinho facing multiple issues off the pitch",
        "Jailed Ronaldinho facing multiple issues off the pitch - USA TODAY",
        "Militao doesn't respond",
        "Jailed Ronaldinho facing multiple issues off the pitch",
        "FEATURE-War or peace? A threatened Brazilian indigenous tribe weighs its options",
        "EU to take in some child migrants stuck in Greece",
        "Portugal's president in 'exemplary' self-isolation, tests negative for coronavirus",
        "Golden Shoe 2019-20: Top Goalscorers in Europe, Latest Points on March 9",
        "5% increase in life satisfaction in Ireland, says OECD",
        "Premier League stats: Ole Gunnar Solskjaer marks 50th Man Utd game in style",
        "Spurs, Liverpool, PSG seek Champions League revival",
        "Climate Change Once Made Ancient Creatures Shrink, and As Global Temperatures Rise, It Might Happen Again",
        "Ronaldo on 1000th: 'I'm so proud'",
        "This Day in History: March 9",
        "Turkey's Erdogan presses European leaders in Brussels amid renewed refugee crisis at Greek border",
        "EU chiefs hold ‘different opinions’ on migration deal with Turkey",
        "On-field tragedy: Nigerian football player dies after colliding with opponent",
        "Coronavirus: Olympiakos v Wolves in Europa League behind closed doors",
        "Coronavirus and Premier League: Key questions about what lies ahead",
        "Scottish Gossip: Rangers, Scotland, Leverkusen, Gilmour, Barisic",
        "Italy's top sports body calls for all events to be canceled until April 3",
        "Coronavirus: Rangers trip to Bayer Leverkusen could be behind closed doors",
        "Ole Gunnar Solskjaer reveals tweaks needed to make Manchester United title challengers next season",
        "No fans will attend Wolves' clash at Olympiacos",
        "EU unveils green Africa policy, seeks new start after migrant crisis",
        "Sevilla-Roma: Police wants closed doors",
        "Sevilla-Roma behind closed doors",
        "Madrid to close all schools for 2 weeks after virus spike",
        "PM: Serie A suspended during Coronavirus",
        "Sevilla vs Roma to be played behind closed doors",
        "Which Champions League and Europa League matches are affected by the Coronavirus?",
        "Willian Says New Contract Talks Have Stalled, Unsure If He Will Stay at Chelsea",
        "Scottish Premiership: What did we learn from the weekend fixtures?",
        "Madrid to close all schools for 2 weeks after virus spike",
        "LaLiga to decide on whether matches will be held behind closed doors due to Coronavirus",
        "Coronavirus to drive European airline industry shakeout",
        "Coronavirus to drive European airline industry shakeout"
    ],
    "2020-03-10": [
        "Portugal suspends flights to, from Italy due to coronavirus",
        "Global travel slowdown means lots of deals",
        "Argentina calls up 6 Italy-based players for WCup qualifiers",
        "EU considers measures to cushion businesses from coronavirus impact",
        "Amber Barrett insists Ireland must be ‘wise and smart’ in Montenegro",
        "All you need to know: Montenegro v Republic of Ireland",
        "The New Mutants same-sex love story confirmed with Maisie Williams role",
        "Champions League last 16: What are each side's chances?",
        "Real Madrid cancel Classic Match against Porto on March 29",
        "Monchi's past & present",
        "FOCUS-Uber's challenge to balance driver safety with customer privacy",
        "Steven Bergwijn out for season, Jose Mourinho still confident of Spurs success",
        "Uber's challenge to balance driver safety with customer privacy",
        "FOCUS-Uber's challenge to balance driver safety with customer privacy",
        "Portugal suspends flights to, from Italy due to coronavirus",
        "Klopp wary of Atletico’s dark arts with Liverpool in danger",
        "Brazil's Azul cuts flights to Portugal, Florida due to coronavirus -CEO",
        "Germany to take 100 children from Greek refugee camp",
        "Demanding More Cash, Erdogan Walks Out of EU Meeting Over Migrant Crisis",
        "Virus already causing Olympic chaos at qualifying events",
        "Is This How Europe Ends?",
        "Greece was one thing – Italy may be too big for the EU to save",
        "Pinatar Cup: Winners Scotland finish tournament with 2-1 win over Northern Ireland",
        "Coronavirus: How this Singapore illustrator’s comics fight misinformation in the age of COVID-19",
        "Scudetto play-offs 'being considered'",
        "Significant victories for Daniel Coyle and Padraig McCarthy",
        "UEFA: No requests to postpone Euro 2020",
        "4 entrepreneurs with products stuck overseas tell us how they've kept US customers happy and sales thriving as the coronavirus breaks global supply chains",
        "Global travel slowdown means lots of deals",
        "Cristiano Ronaldo visits his mother in Portugal due to suspension of Serie A",
        "Denis O’Brien: stop giving ‘B&’ to businesses ‘taking advantage’ of Irish tax laws",
        "Denis O’Brien: stop giving ‘B&B’ to businesses ‘taking advantage’ of Irish tax laws",
        "Stop ‘B&B’ for firms availing of Irish tax laws, Denis O’Brien urges",
        "Chase Offers are my new favorite credit card deals — I saved $64 on purchases with Whole Foods, Staples, and more last month alone",
        "Man Utd Europa League tie behind closed doors",
        "Coronavirus spread: Barcelona v Napoli to be played behind closed doors",
        "Coronavirus: Wolves say Olympiakos Europa League tie is 'unnecessary risk'",
        "Manchester City's Pep Guardiola: There's No Sense to Playing Games Without Fans",
        "Coronavirus: Manchester United Europa League game vs LASK to be played behind closed doors",
        "Coronavirus: Pep Guardiola prefers postponing games to keeping fans out",
        "Liverpool v Atletico Madrid: Jordan Henderson fit for Champions League second leg",
        "Barcelona to host Napoli in empty stadium because of virus",
        "Coronavirus: What sporting events are affected by the outbreak?",
        "Coronavirus | Serie A, all sport in Italy halted",
        "Coronavirus: Rangers' away tie with Bayer Leverkusen set to be played behind closed doors",
        "Totti: 'Europa League an objective'",
        "Gunners coronavirus fears: Arsenal release statement after Olympiacos owner reveals he has illness",
        "Italy suspends all sporting fixtures, Socceroos games suspended",
        "Getafe: 'We will not travel for Inter'",
        "Monchi's past & present",
        "Wolves condemn UEFA for not postponing Olympiacos clash",
        "Getafe: 'Could cancel Inter game'",
        "Manchester United's UEL Game at LASK to Be Behind Closed Doors Amid Coronavirus",
        "Scottish Gossip: Rangers, Tavernier, Scotland, Griffiths, Hibernian, Aberdeen"
    ],
    "2020-03-11": [
        "Europa League 2020: Round-of-16 Odds, Live Stream, TV Schedule and Predictions",
        "Science is Finally Supporting Alcoholics Anonymous",
        "4 music events to catch in the D.C. area over the next several days",
        "Chloe Mustaki is ready to pick herself up again",
        "Rangers v Bayer Leverkusen",
        "Rangers v Bayer Leverkusen",
        "Uber's challenge to balance driver safety with customer privacy",
        "Sevilla players don't want to face Roma",
        "Photos show how coronavirus precautions left everything from schools to stadiums deserted across Spain — as more than 1,600 cases have already been reported",
        "Ronaldo remains in Portugal",
        "Spanish club Getafe refuses to play game in Italy amid virus",
        "Science is Finally Supporting Alcoholics Anonymous",
        "Official: Rugani has Coronavirus",
        "Official: Sevilla-Roma off",
        "The 20 countries in the world best prepared for an epidemic like coronavirus still aren't really all that ready",
        "Sevilla players don't want to face Roma",
        "Renowned chef brings taste of Newfoundland to Edmonton students",
        "Renowned chef brings taste of Newfoundland to Edmonton students",
        "Fighting virus, ECB to run to Europe's rescue. Again.",
        "Factbox: Sports events hit by the coronavirus epidemic",
        "Bellator 241 breakdown: Patricio Freire can expect chaos from Pedro Carvalho. Will he handle it?",
        "Arsenal vs Man City postponed with Gunners players self-isolating after contact with infected Olympiacos chairman",
        "Paul Pogba Reportedly Interested in Long-Term Contract with Manchester United",
        "Man United's Scott McTominay Says 'Demanding' Bruno Fernandes Is 'A Born Winner'",
        "The best board games to buy at Walmart",
        "Juventus player Rugani tests positive for coronavirus",
        "Spanish club Getafe refuses to play game in Italy amid virus",
        "Bernie Sanders Still Leads Biden in Race for Hollywood Cash",
        "Roma 'will not travel' to Sevilla for Europa League game",
        "LASK vs. Manchester United: Europa Odds, Live Stream, TV Schedule",
        "LASK v Manchester United: Ole Gunnar Solskjaer will 'understand' if the season is cut short",
        "Europa League 2020: Round-of-16 Odds, Live Stream, TV Schedule and Predictions",
        "Coronavirus updates: College basketball tournaments under the microscope",
        "Coronavirus: Roma abandon Europa League trip to Sevilla after plane not authorised to land",
        "Wolves captain Conor Coady admits coronavirus concerns ahead of Europa League trip to Olympiacos",
        "Manchester City v Arsenal: Premier League match postponed over coronavirus fears",
        "Spanish club Getafe refuses to play game in Italy amid virus",
        "Arsenal-City game called off with players in self-isolation",
        "Rangers v Bayer Leverkusen",
        "Coronavirus: Timeline of the outbreak's impact on football across the world",
        "Coronavirus: Man Utd fans out of pocket after Austria 'empty stadium' ruling",
        "Rangers v Bayer Leverkusen: Europa League 'devalued' by no fans - Peter Bosz",
        "Rangers: James Tavernier battling to prove fitness for Bayer Leverkusen match",
        "Players' union FIFPro to support members who ask for training or matches to be cancelled",
        "Official: Italy-Spain Europa League games suspended",
        "Italian Soccer Team's Plane Not Authorized to Land in Spain Due to Coronavirus Outbreak",
        "Sevilla players don't want to face Roma",
        "English Premier League game postponed because of coronavirus concerns"
    ],
    "2020-03-12": [
        "Brazil's gangs emerge as major cocaine exporters, flooding Europe with white powder",
        "Brazil's gangs are flooding Europe with cocaine",
        "Portugal orders schools, night clubs shut due to coronavirus",
        "Airlines extend waivers, adjust schedules in wake of new restrictions",
        "Barristers in Cork notified of coronavirus case in their offices",
        "Portugal's hotels brace for coronavirus losses, U.S. travel impact",
        "Cristiano Ronaldo in quarantine in Portugal but 'symptom-free'",
        "12 things to do in the D.C. area this weekend",
        "LASK vs Manchester United live stream: how to watch Europa League 2020 football online from anywhere",
        "Factbox: Closer look at contract giving IOC power over Tokyo 2020 fate",
        "SPECIAL REPORT-Brazil's gangs emerge as major cocaine exporters, flooding Europe with white powder",
        "Brazil's gangs emerge as major cocaine exporters, flooding Europe with white powder",
        "Bacurau review: The spaghetti-splatter-arthouse-sci-fi-horror of the year",
        "Are there many better centre-backs around than Felipe?",
        "Trump's coronavirus travel ban excludes the countries where he has golf courses struggling for business",
        "Factbox: Sports events hit by the coronavirus pandemic",
        "Portugal orders schools, night clubs shut due to coronavirus",
        "Here is how Trump's travel ban on Europe will work, and exactly who it applies to",
        "TikTok is filled with dark jokes and conspiracies about a notorious child kidnapping case",
        "Guinea Bissau: A deadly mix of guns, cocaine and cashew nuts",
        "Leicester City: Ricardo Pereira out for season with a knee injury as James Maddison picks up a calf problem",
        "Cristiano Ronaldo is in self-quarantine after teammate tests positive for coronavirus",
        "Coronavirus: Countries enforce mass closures to stem spread",
        "Cristiano Ronaldo QUARANTINED in Portugal after Juventus teammate Rugani tests positive for coronavirus",
        "Brazil's gangs emerge as major cocaine exporters, flooding Europe with white powder",
        "Proclamation of suspension of travel from Europe to U.S.",
        "Brazil's gangs are flooding Europe with cocaine",
        "Juventus footballer Daniele Rugani tests positive for coronavirus",
        "Cristiano Ronaldo back home in Madeira as Juventus grapples with coronavirus outbreak",
        "Factbox: Here's what the new U.S. restrictions on Europe mean for travelers",
        "Champions League matches postponed",
        "Champions League games postponed as virus hits world soccer",
        "Trump forced to clarify coronavirus travel ban trade confusion after misspeaking during historic address",
        "Coronavirus travel ban: American, United and Delta airlines cap flight fares from Europe to U.S. - Fox News",
        "Olympiakos 1-1 Wolves: Pedro Neto scores valuable away goal",
        "Men's tennis, NBA basketball, La Liga soccer: coronavirus shreds sports calendar",
        "Man United, Basel close in on Europa League quarterfinals",
        "Juventus' Daniele Rugani Responds After Positive Coronavirus Test: 'I'm Fine'",
        "Factbox: Sports events hit by the coronavirus pandemic",
        "Europa Leauge direkte: Storseier for Solskjærs United",
        "LASK vs Manchester United prediction: How will Europa League fixture play out tonight?",
        "Europa Leauge direkte: Solskjærs United møter Rosenborgs overmenn",
        "UEFA set to suspend Champions League and Europa League amid coronavirus pandemic – reports",
        "Juventus footballer Daniele Rugani tests positive for coronavirus",
        "Arsenal manager Arteta tests positive for coronavirus",
        "Scottish Gossip: Rangers, Bayer Leverkusen, Motherwell, Aberdeen",
        "Real Madrid soccer team put in quarantine",
        "Sport-by-sport look at the impact of coronavirus around the world",
        "Champions League matches postponed",
        "Coronavirus: How the virus has impacted sporting events around the world",
        "Real Madrid team put in quarantine, Spanish league stops",
        "Report: UEFA asked Roma and Inter to pull out of EL",
        "Klopp’s ‘not proper football’ jibe betrays continued lack of respect for Simeone’s genius",
        "Report: Euro 2020 delayed to 2021"
    ],
    "2020-03-13": [
        "Portugal to help firms through coronavirus, tough measures in place",
        "Vacation interrupted: Five hours at the Paris airport amid the coronavirus pandemic and Trump's travel ban",
        "Europe travel ban: Will it be possible to sneak into the US via the UK?",
        "Over 40 international routes suspended as American, Delta, and United react to Trump's surprise travel restrictions",
        "Parents want more child care cash as coronavirus shuts schools in Portugal",
        "Parents want more child care cash as coronavirus shuts schools in Portugal",
        "List of sports events affected by the coronavirus pandemic",
        "Six of the best films to see in the cinema this weekend",
        "Marcos Llorente follows in his father's footsteps",
        "Trump's Europe Travel Ban Delivers Another Blow to Airlines",
        "Factbox: Here's what the new U.S. restrictions on Europe mean for travelers",
        "No penalty? Hotel chains differ on cancellation fee policies around the coronavirus",
        "Portugal to help firms through coronavirus, tough measures in place",
        "Italy coronavirus death toll surges past 1,000: Live updates",
        "Ronaldo issues statement from quarantine after Juventus teammate's positive coronavirus test",
        "I Make Coronavirus Test Kits for a Living—We Are All Working in a Frenzy",
        "Euro 2020 play-offs: Fifa recommends all internationals are cancelled",
        "Juventus respond to claims Paulo Dybala is second player to test positive for coronavirus",
        "Passengers flying to the U.S. from 26 countries in Europe will face enhanced screening - The Washington Post",
        "Premier League suspended over coronavirus",
        "Vacation interrupted: Five hours at the Paris airport amid the coronavirus pandemic and Trump's travel ban",
        "COVID19 & cash: The financial implications of the coronovirus pandemic on sport",
        "Factbox: Global sports events hit by coronavirus pandemic",
        "Coronavirus: European countries close schools but allow children of health and public service workers to come in",
        "EU states to take in 1,600 migrant children in Greece",
        "Panic and confusion as the US is set to start Europe travel restrictions today",
        "Virus concerns hit schools, sports and entertainment",
        "Cristiano Ronaldo Discusses Coronavirus Pandemic During Isolation",
        "Demiral: 'Continue work at home'",
        "Coronavirus wipes out most of world's major sports events on an unprecedented day",
        "Europa League 2020: Scores, Odds After Thursday's Round-of-16 Leg 1 Results",
        "Premier League, Champions League call off matches",
        "Champions League, Europa League games postponed by UEFA",
        "The Latest: Indian Premier League T20 cricket delayed",
        "French Ligue 1 and 2 suspended because of coronavirus outbreak",
        "UEFA SUSPEND all Champions League and Europa League matches due to coronavirus",
        "Tokyo 2020: Olympic torch relay leg in Greece cancelled",
        "Here's how the sports world is being affected by coronavirus",
        "Coronavirus: How the global pandemic has affected Premier League clubs",
        "UEFA Champions League Postponed Indefinitely",
        "'Ready to lend a hand': Russia willing to host more games at Euro 2020 as coronavirus pandemic threatens tournament",
        "Premier League and Champions League competitions suspended",
        "Premier League, Champions League call off matches",
        "'Absolutely not': Japan reacts to Donald Trump’s calls to postpone Olympics amid coronavirus pandemic",
        "COVID19 & cash: The financial implications of the coronovirus pandemic on sport",
        "Steven Gerrard: Rangers boss refuses to entertain Europa League cancellation",
        "Rangers: Europa League trip to Bayer Leverkusen postponed",
        "Euros, Olympics and the Kentucky Derby: Coronavirus may kill YOUR favorite event NEXT",
        "Scottish football postponed over coronavirus"
    ],
    "2020-03-14": [
        "Trump's Europe Travel Ban Sees Panicked Passengers Spend up to $20,000 on Last-minute Flights to the U.S.",
        "Bruno Fernandes addresses 'shush' gesture towards Pep",
        "Six feet of social distance? For hairdressers, that may not be possible.",
        "Brazil slow to act in sport on coronavirus",
        "Brazil slow to act in sport on coronavirus",
        "UK and Ireland added to US travel ban amid COVID-19 concerns",
        "Morocco halts flights with Belgium, Netherlands, Germany and Portugal",
        "Coronavirus: US travel ban on 26 European countries comes into force",
        "Airbnb adds US to virus refund policy",
        "Bruno Fernandes 'Didn't Think Twice' About Manchester United Transfer Decision",
        "Astronomers discover scorching hot planet where it rains iron",
        "Coronavirus: Toilet paper manufacturer struggles to meet ‘unprecedented demand’",
        "Canadians scramble to return home after feds warn flights may become scarce",
        "UPDATE 1-Here's what the new U.S. restrictions on Europe mean for travelers",
        "Bruno Fernandes addresses 'shush' gesture towards Pep",
        "Wayne Rooney Recalls Taking Cristiano Ronaldo to McDonald's in Weight Gain Quest",
        "Coronavirus: What are the British up to?",
        "Coronavirus: Five things to help make sense of the week",
        "Bruno Fernandes plays down his impact since joining Manchester United",
        "Rhode Island has 20 confirmed coronavirus cases, up from 14",
        "Therapy? 30 years of power chords and metal riffs",
        "Britain and Ireland added to U.S. travel restrictions as coronavirus barriers expand",
        "Here's what the new U.S. restrictions on Europe mean for travellers",
        "FACTBOX-Sports events around the world hit by coronavirus pandemic",
        "Factbox: Global sports events hit by coronavirus pandemic",
        "Wes Brown Praises Manchester United Defence: 'It Has Just Started to Click'",
        "Angelo Ogbonna Slams 'Completely Unacceptable' EPL Response to COVID-19 Pandemic",
        "Transfer rumours: Euro 2020, Mahrez, Aubameyang, Bailey, Kondogbia, Neymar",
        "Report: Liverpool to Be Awarded EPL Title If Season Is Cancelled Due to COVID-19",
        "Bruno Fernandes 'Didn't Think Twice' About Manchester United Transfer Decision",
        "'Total shutdown': European football authorities braced for impact of complete cancellation of football until September – report",
        "UEFA to change European competition format",
        "Inditex to temporarily close all stores in Spain over coronavirus",
        "As coronavirus spreads, here's what's been canceled or closed",
        "Scottish Gossip: Coronavirus shutdown, Scottish FA, Celtic, Hearts, Aberdeen, Hibs",
        "'Evaluating Euro 2020 postponement'",
        "Is the global economy headed for recession?",
        "Premier League Teams to Meet to Discuss Plan to Complete Season Despite COVID-19",
        "Gibraltar Open matches go ahead without referees",
        "UEFA urged to postpone Euro 2020, focus on domestic leagues",
        "UEFA 'Evaluating' Whether to Postpone Euro 2020 Because of Coronavirus",
        "Fifa recommends all matches in March and April should be postponed",
        "Fred Can Be 'Perfect Midfield Player' at Manchester United, Says Owen Hargreaves",
        "Prague: The elimination that changed Sevilla",
        "Inditex to temporarily close all stores in Spain over coronavirus"
    ],
    "2020-03-15": [
        "Beds for the sick: Cristiano Ronaldo to convert his hotels to temporary hospitals to help victims of coronavirus",
        "Dream of a lifetime: Transgender man yearns to join military",
        "Dream of a lifetime: Transgender man yearns to join military",
        "Injury blow for Afghan refugee boxer in Tokyo qualifiers",
        "Recession risk calls for joint response: UN chief",
        "Tourism between Spain, Portugal to be suspended due to coronavirus: Portuguese government",
        "Olympics: Injury blow for Afghan refugee boxer in Tokyo qualifiers",
        "Report: Barcelona Targeting Four Key Transfers in 2020 Summer Window",
        "UPDATE 1-Egypt trading suspended as shares plunge due to coronavirus",
        "Egypt trading suspended as shares plunge due to coronavirus",
        "Brazilian team wear masks in protest at having to play",
        "Coronavirus: EU states record highest one-day death toll",
        "Tourism between Spain, Portugal to be suspended due to coronavirus: Portuguese government",
        "Liga MX Suspends All Matches Indefinitely amid Coronavirus Concerns",
        "Transfer rumours: Ighalo, Van de Beek, Ronaldo, De Bruyne, Sterling, Kane",
        "Beds for the sick: Cristiano Ronaldo to convert his hotels to temporary hospitals to help victims of coronavirus",
        "Mutual U.S., U.K coronavirus travel bans strain transatlantic relations",
        "Ronaldo to turn hotels into hospitals",
        "Cycling: UCI seeks retroactive end to Olympic qualifying process",
        "Achanta Sharath Kamal ends decade long title drought, clinches Oman Open",
        "Injury blow for Afghan refugee boxer in Tokyo qualifiers",
        "Achanta Sharath Kamal storms into final at Oman Open",
        "The uncertain futures of Atletico Madrid's loaned out players",
        "Factbox: Sports events around the world hit by coronavirus pandemic",
        "News24.com | READ IN FULL | 'The most definitive Thuma Mina moment' for SA: Ramaphosa's plan for Covid-19",
        "Portugal declares official commemoration day for inquisition of Jews",
        "Serie A impacted by coronavirus with 11 confirmed cases in three days",
        "Tourism between Spain, Portugal to be suspended due to coronavirus: Portuguese government",
        "Morocco halts flights with 25 more countries, confirms 18 coronavirus cases",
        "Sports events around the world hit by coronavirus pandemic",
        "Rallying - Mexico round cut short by coronavirus restrictions, Ogier wins",
        "The Latest: Italy to ask UEFA to postpone Euros",
        "Final Four option for UEFA?",
        "Transfer market moved by coronavirus?",
        "Serie A clubs could lose 700m",
        "Tebas implies La Liga season won't resume",
        "Trump marches on at the spectator-less Gibraltar Open",
        "Trump pockets £150k bonus after winning Gibraltar Open",
        "Factbox: Sports events around the world hit by coronavirus pandemic",
        "Coronavirus: Main events cancelled in UK and around the world",
        "Sports events around the world hit by coronavirus pandemic",
        "Hibernian manager Ross defends Scottish football chiefs",
        "COVID-19: Where every sport lies after mass disruption"
    ],
    "2020-03-16": [
        "Volkswagen's Portugal plant reduces output by 16% due to coronavirus",
        "Portugal confirms country's first death from coronavirus",
        "Manchester United's Bruno Fernandes Named EPL Player of the Month for February",
        "Portugal, Spain suspend passenger air, rail traffic due to coronavirus",
        "Three-year-old among 6 new COVID-19 cases in Maharashtra",
        "Who were the Kunjali Marakkars?",
        "Volkswagen's Portugal plant reduces output by 16% due to coronavirus",
        "London boxing qualifiers closed to spectators due to virus",
        "Carmakers curb European production as coronavirus hits",
        "London boxing qualifiers closed to spectators due to coronavirus",
        "Bruno Fernandes named February’s Premier League player of the month",
        "London boxing qualifiers closed to spectators due to virus",
        "What a shot! 24 amazing sports photos",
        "Transfer rumours: Mahrez, Umtiti, Dembele, Telles, Martinez",
        "Brazil President takes selfies, cheers demonstrators despite virus warnings",
        "Messi's first day at MARCA",
        "The first eleven academy products to debut under Simeone: One world champion, one in Luxembourg and another in Tunisia",
        "Coronavirus: Germany latest country to close borders",
        "EU executive warns against border closures as way to curb coronavirus",
        "Portugal confirms country's first death from coronavirus",
        "Factbox: Sports events around the world hit by coronavirus pandemic",
        "Volkswagen's Portugal plant reduces output by 16% due to coronavirus",
        "Spain & Portugal lock down borders to slow coronavirus spread",
        "Portugal, Spain suspend passenger air, rail traffic due to coronavirus",
        "Azul cuts international flights, LATAM Airlines could take 'additional measures'",
        "U.S. military modifies major exercise in Europe over coronavirus",
        "Coronavirus: Vauxhall factories to shut down over pandemic",
        "Three-year-old among 6 new COVID-19 cases in Maharashtra",
        "European nations grapple with a united plan to combat coronavirus",
        "Coronavirus update: Britons urged to avoid social contact as EU restricts foreign travellers",
        "German travel tech startups hunker down for 'nuclear winter' - Reuters",
        "'You are our heroes!': Europeans applaud doctors and nurses from balconies amid coronavirus outbreak",
        "Table tennis | I played my best in the final: Sharath Kamal",
        "Volkswagen's Portugal plant reduces output by 16% due to coronavirus",
        "Brazil airline Azul says suspending all international flights out of main hub",
        "Ontario Hospitals to ramp down elective surgeries amid increasing number of COVID-19 cases",
        "Southern European sovereigns, Europe banks' CDS jump -IHS Markit",
        "Coronavirus: Q&A as Uefa meet to discuss Euro 2020 & Champions League",
        "Coronavirus: Mini-tournament could decide Champions League and Europa League",
        "Factbox: Sports events around the world hit by coronavirus pandemic",
        "BA-owner has not asked for state aid: CEO",
        "Factbox: Retailers close stores around globe to curb coronavirus spread",
        "Coronavirus chaos spares no one, as sports stars, politicians & Hollywood A-listers are INFECTED",
        "Coronavirus crisis leaves Uefa 'in shock' as crucial talks aim to salvage football season",
        "BA-owner has not asked for state aid - CEO",
        "Report: Godin could leave Inter",
        "Dzeko: 'Roma deserve a trophy'",
        "Napoli are interested in Marc Cucurella",
        "Euro 2020: Italy to lead calls for postponement due to coronavirus outbreak",
        "Indy Football Podcast: Coronavirus, a changing calendar and non-league fights for its future",
        "Fate of Euro 2020 to be determined as UEFA set for crisis meeting",
        "Former Serie A players in Süper Lig title race",
        "Euro 2020 has to make room",
        "Odion Ighalo Says He 'Never Imagined' He Would Play for Manchester United",
        "UEFA contemplate everything from season write-off to express competitions",
        "The future of LaLiga Santander and Europe's other leagues",
        "The first eleven academy products to debut under Simeone: One world champion, one in Luxembourg and another in Tunisia"
    ],
    "2020-03-17": [
        "Holidaymakers isolated at Portuguese hotel after guest tests positive for coronavirus",
        "Coronavirus live updates | India bans entry from EU, U.K",
        "\"How are we going to eat?\" Virus tests Europe's social nets",
        "\"How are we going to eat?\" Virus tests Europe's social nets",
        "Social distancing from space",
        "Cristiano Ronaldo 'turning his hotels into coronavirus treatment centres' is a hoax",
        "\"How are we going to eat?\" Virus tests Europe's social nets",
        "\"How are we going to eat?\" Virus tests Europe's social nets",
        "This is how postponing Euro 2020 affects the Spain squad",
        "Brazil inmates captured after breakout sparked by coronavirus",
        "Brazil recaptures 600 prisoners who fled before coronavirus lockdown",
        "Coronavirus: Hundreds of inmates escape Brazil prisons ahead of lockdown",
        "Hundreds of Brazilian Prisoners Escape After Prison Riot Over Cancelled Easter Exits Due to Coronavirus",
        "Naked woman jumps into the River Douro",
        "Mourinho started looking for moles at Real Madrid from his first day in charge",
        "The top 10 transfer rumours",
        "'Hundreds' of inmates escape Brazil jails ahead of coronavirus lockdown",
        "Coronavirus lockdown in Brazil's jails spurs 'hundreds' of inmates to escape",
        "The 50 most promising players at La Masia at the beginning of the decade: Where are they now?",
        "Volkswagen prepares to halt production at European plants, likely for a few weeks",
        "Bruno Fernandes Talks 'Idol' Cristiano Ronaldo, 'Incredible' Old Trafford Crowd",
        "Coronavirus: Spanish deaths surge close to 500",
        "Spain turns back cars from land borders as coronavirus death toll rises to 491",
        "Audi's Hungarian plant to halt production on Monday",
        "The coronavirus fake news pandemic sweeping WhatsApp",
        "Volkswagen prepares to halt production at European plants, likely for a few weeks",
        "Confusion, concern as locked-down Philippines starts coronavirus quarantine",
        "Sadio Mane makes coronavirus donation to Senega.",
        "Why Atletico Madrid Consider Goalkeeper Jan Oblak to Be Their Leo Messi",
        "UPDATE 2-VW starts shutting down production in Europe in face of coronavirus",
        "Factbox: What Africa is doing to fight coronavirus",
        "Coronavirus live updates | India bans entry from EU, U.K",
        "H&M closes all stores in biggest markets Germany and the United States",
        "Coronavirus travel restrictions around the world: A country-by-country list",
        "Nicole Saldana's shoes channel the spirit of 90s teen movies",
        "Juventus Women in self-isolation",
        "News24.com | Coronavirus in SA: International restrictions on travel to begin on Wednesday",
        "Government coronavirus plans call for extraordinary measures",
        "Happy birthday to Trapattoni",
        "The Hushed Spectacle of Soccer Matches In Empty Stadiums",
        "Why Atletico Madrid Consider Goalkeeper Jan Oblak to Be Their Leo Messi",
        "UEFA Euro 2020 Delayed for a Year by Coronavirus",
        "Euro2020: Kick-off delayed until next year",
        "UEFA begins talks with postponing Euro 2020 likely",
        "UEFA makes formal proposal to delay Euro 2020 by one year",
        "Bolsa da Europa operam em baixa; Austrália fecha em alta de quase 6%",
        "Coronavirus | UEFA postpones Euro 2020 by a year",
        "UEFA to demand hefty $336 MILLION in compensation to postpone EURO 2020 until 2021",
        "Options for Champions League and Europa League",
        "UEFA makes formal proposal to delay Euro 2020 by 1 year",
        "UEFA Announces Intention to Complete Champions, Europa Leagues Amid Coronavirus",
        "Q&A: UEFA President Čeferin on moving Euros to 2021",
        "Some teams and players may benefit from coronavirus outbreak",
        "Valencia say 35% of squad, staff tested positive for coronavirus",
        "Factbox: Decisions made at UEFA meeting where Euros were postponed to 2021",
        "Euro 2020 championship postponed over coronavirus - Norwegian and Swedish FAs",
        "Clubs commit to concluding season",
        "New dates for Champions and Europa League finals",
        "Premier League and FA to talk on conclusion of season"
    ],
    "2020-03-18": [
        "From the air: Coronavirus turns public places into ghost towns",
        "Chairman of Santander's Portuguese unit dies from coronavirus",
        "UPDATE 1-Chairman of Santander's Portuguese unit dies from coronavirus-report",
        "Chairman of Santander's Portuguese unit dies from coronavirus-report",
        "Chairman of Santander's Portuguese unit dies from coronavirus",
        "Coronavirus: Eurovision Song Contest cancelled for 2020",
        "An enlightening lesson from nature",
        "Antonucci: 'My target is Roma'",
        "Portugal announces 9.2 billion euros of coronavirus aid",
        "Chairman of Santander's Portuguese unit dies from coronavirus",
        "UPDATE 1-Portugal announces 9.2 billion euros of coronavirus aid",
        "UPDATE 1-Portugal announces 9.2 billion euros of coronavirus aid",
        "Gauteng government staffers ditch work amid fears of the spread of coronavirus",
        "15 People in Brazil's Delegation to the U.S. Now Confirmed to Have Coronavirus",
        "UPDATE 2-Brazil cuts rates, pledges full arsenal in coronavirus fight",
        "Antonucci: 'My target is Roma'",
        "Trincao: I'm not thinking about winning the Champions League or Ballon d'Or",
        "Antonucci: 'My target is Roma'",
        "11 best products to effectively work from home",
        "Euro 2021 offers a new scenario for many players",
        "From the air: Coronavirus turns public places into ghost towns",
        "US-Canada border to close for nonessential travel to slow coronavirus spread, Trump says",
        "Chairman of Santander's Portuguese unit dies from coronavirus",
        "IKEA closes all U.S. stores, China back up except for Wuhan store",
        "Factbox: Carmakers suspend European production in face of coronavirus crisis",
        "Tennis tours stop until June for COVID-19; rankings frozen",
        "Chairman of Santander's Portuguese unit dies from coronavirus-report",
        "UPDATE 1-Chairman of Santander's Portuguese unit dies from coronavirus-report",
        "Coronavirus: Travel restrictions, border shutdowns by country",
        "Portugal announces 9.2 billion euros of coronavirus aid",
        "Antonucci: 'My target is Roma'",
        "Dental Student Who Tested Positive for Coronavirus Treated Patients Says School Asked Him 'Not to Communicate About His Diagnosis'",
        "Chairman of Santander's Portuguese unit dies from coronavirus",
        "The Futuristic Solutions The Internet Is Crowdsourcing to Cure Coronavirus",
        "Sovereign, corporate and bank CDS spike sharply on coronavirus rout",
        "Nigeria bans entry for travelers from 13 countries as it announces five new cases",
        "Coronavirus: Eurovision Song Contest cancelled for 2020",
        "IKEA closes all U.S. stores, China back up except for Wuhan store",
        "Skriniar: 'Always wanted to play with Ronaldo'",
        "Pictures from space: Then and now, with the coronavirus among us",
        "Explore space using these free tools while you’re stuck at home",
        "RFEF Chief Luis Rubiales: 'Unfair' to Hand Barcelona Title If Season Unfinished",
        "Michael O'Neill reveals 'doubts' over Northern Ireland squad",
        "Coronavirus sport news - LIVE: IOC refuse calls to cancel Olympics, Fifa meet after postponing Euro 2020 and Kevin Durant tests positive",
        "Gravina: 'Serie A must conclude, even in July'",
        "Spadafora: 'I believe Serie A can return on May 3'",
        "As coronavirus spreads, here's what's been canceled or closed",
        "Florentino Perez Issues Open Letter to Real Madrid Fans Amid Coronavirus",
        "What a 2021 we have in store: Euro 2021, Copa America, Champions League...",
        "There Is More To Life Than Football - John Obi Mikel Leaves Club After League Is Not Suspended Despite Coronavirus",
        "This is how the football calender could look if the season restarts in mid-May",
        "Italian sports minister sets date aim for resuming Serie A after coronavirus postponement",
        "Mexico under international criticism for coronavirus response",
        "'There is more to life than football' – John Obi Mikel leaves Trabzonspor over coronavirus fears",
        "NASA posts remarkable view of Jupiter",
        "How to claim Euro 2020 ticket refunds after Uefa move tournament to 2021 due to coronavirus",
        "Rakitic on coronavirus: Everyone should follow the advice of the authorities",
        "Manchester City Must Not Underestimate Real Madrid in UCL, Says Ilkay Gundogan",
        "Factbox: Sports events around the world hit by coronavirus pandemic",
        "Tebas: We're planning to resume all European leagues in May, or sooner"
    ],
    "2020-03-19": [
        "Portugal restricts movement to stem coronavirus, rules out rationing",
        "Report: Leao asked to compensate Sporting",
        "Bruno Fernandes 'One of My Best Team-Mates,' Says Inter Milan's Milan Skriniar",
        "Peter Whittingham death: Tributes paid to Cardiff City legend who died aged 35",
        "Portugal restricts movement to stem coronavirus, rules out rationing",
        "7 New Songs to Help You Feel Less Socially Distant",
        "Meet Francisco Trincao: The Portuguese Sensation Joining Barcelona This Summer",
        "The Jesus Rolls review: This one-joke Big Lebowski character didn't need a life of his own",
        "Meet Francisco Trincao: The Portuguese Sensation Joining Barcelona This Summer",
        "Ryanair, Jet2 and easyJet leave passengers stranded in Europe with no way home",
        "Portugal restricts movement to stem coronavirus, rules out rationing",
        "Meet Francisco Trincao: The Portuguese Sensation Joining Barcelona This Summer",
        "South African player tests positive for the coronavirus",
        "U.N. chief says global recession due to coronavirus 'a near certainty'",
        "Spring Equinox Google Doodle Celebrates the Start of the 2020 Spring Season",
        "Juventus 'let stars leave' after quarantine",
        "REUTERS NEWS SCHEDULE AT 10 a.m. GMT/6 a.m. ET",
        "Factbox: Carmakers suspend European production over coronavirus",
        "U.N. chief says global recession due to coronavirus 'a near certainty'",
        "Bruno Fernandes 'One of My Best Team-Mates,' Says Inter Milan's Milan Skriniar",
        "Coronavirus: Europe already looking to extend virus lockdowns",
        "ATP, WTA suspend tennis tours through June 7, freeze player rankings",
        "Casillas' nostalgic photo that includes a young Luis Figo",
        "Higuain returns to Argentina to visit his sick mother",
        "COVID 19: Travel Restriction And Advisory That India Has Put In Place",
        "South African player tests positive for the coronavirus",
        "Factbox: Sports events around the world hit by coronavirus pandemic",
        "Portugal restricts movement to stem coronavirus, rules out rationing",
        "Irish Open at Mount Juliet looks next in line to be postponed",
        "Clubs feeling the pinch as golf tourism dries up due to coronavirus threat",
        "Claudio Marchisio Told Paul Pogba 'He Was Wrong' to Rejoin Manchester United",
        "Meet Francisco Trincao: The Portuguese Sensation Joining Barcelona This Summer",
        "Soccer leagues plan for games they can only hope to play",
        "Serie A clubs reject Champions weekends",
        "Soccer's paralysis sparks questions about player contracts",
        "Napoli and Roma eye Belotti",
        "Pastore: 'We keep in shape at home'",
        "Q&A: What next for English football after suspension extended?",
        "Willian pledges to play for Chelsea beyond end of deal",
        "Manchester United to pay casual workers for cancelled Premier League games due to coronavirus",
        "David Luiz Talks Arsenal Transfer, Says Chelsea Staff Begged Him to 'Come Back'",
        "Wissam Ben Yedder Says Barcelona Have Been Pursuing Him Since Last Summer",
        "Premier League clubs to meet; World Rugby must make example of Eddie Jones",
        "Football leagues plan for games they can only hope to play",
        "Rakitic and Sevilla: A love story with a happy ending?",
        "Kieran Tierney: Injury Layoff at Arsenal the 'Toughest Time of My Life'",
        "Factbox: Sports events around the world hit by coronavirus pandemic",
        "Some Spanish clubs decide to leave virus tests for others",
        "Premier League clubs meeting with hope of finishing season",
        "Soccer's paralysis sparks questions about player contracts"
    ],
    "2020-03-20": [
        "Electric scooter-sharing grinds to a halt in response to the COVID-19 pandemic",
        "Sporting Lisbon President to Work as Doctor During Coronavirus Pandemic",
        "Soldiers are being drafted in to help after Italy surpasses China in number of coronavirus deaths",
        "Exclusive: Coronavirus, gas slump put brakes on Exxon's giant Mozambique LNG plan",
        "Finland crowned world's happiest country for third year running",
        "Electric scooter-sharing grinds to a halt in response to the COVID-19 pandemic",
        "Sporting Lisbon President to Work as Doctor During Coronavirus Pandemic",
        "Hong Kong Records Its Biggest Rise in Coronavirus Cases as New Wave of Infections Crashes Into Asia",
        "Ted Baker says 38% of global retail sales hit by coronavirus",
        "Cristiano Ronaldo 'Can Go on Until 40,' Says Paulo Ferreira",
        "Finland crowned world's happiest country for third year running",
        "IKEA closes Hyderabad store",
        "Ryanair passengers receive message saying cancelled flight is back on two hours before departure time",
        "3 new confirmed COVID-19 cases in Ottawa",
        "Coronavirus spreads fear, isolation, death to elderly worldwide",
        "Plans to bring eight minors to Ireland disrupted",
        "Need to watch soccer? Two live matches and many taped games available this weekend",
        "Pot stockpiles, supply chain disruptions, and CBD hand sanitizer: How the cannabis industry is preparing for — and reeling from — the coronavirus pandemic",
        "Robert Lewandowski Happy at Bayern, Says Cristiano Ronaldo Wanted Him at Madrid",
        "Sports events around the world hit by coronavirus pandemic",
        "How Lagarde’s flippancy led to godsend for EU governments fighting Covid-19",
        "Why are Russian military aircraft flying in Irish airspace? Ireland - RTE.ie",
        "Coronavirus spreads fear, isolation, death to elderly worldwide",
        "PK Banerjee was genuine Indian great, with a legacy tough to match",
        "100 songs to help lift your spirits during a pandemic",
        "Coronavirus: How Premier League clubs are trying to help",
        "Germany leads the way on soccer salary cuts as virus hits",
        "UEFA revisit FFP regulations?",
        "Odion Ighalo Enjoying 'Even Greater Moments' Playing for Manchester United",
        "Sports events around the world hit by coronavirus pandemic",
        "UEFA evaluating possibility of suspending Financial Fair Play rules due to coronavirus",
        "Germany leads the way on soccer salary cuts as virus hits",
        "Germany leads the way on soccer salary cuts as virus hits",
        "Borussia Monchengladbach players offer to give up their salaries"
    ],
    "2020-03-21": [
        "Measure seeks to address Iowa's shortage of veterinarians",
        "Exclusive - Coronavirus, gas slump put brakes on Exxon's giant Mozambique LNG plan",
        "Portugal's death toll from coronavirus doubles to 12",
        "Government should launch repatriation operation to get stranded Irish home, says GP",
        "Army joins the production line as ventilator makers scramble to meet demand",
        "INSIGHT-Army joins the production line as ventilator makers scramble to meet demand",
        "INSIGHT-Army joins the production line as ventilator makers scramble to meet demand",
        "Army joins the production line as ventilator makers scramble to meet demand",
        "Udo Kier: ‘Only if you’re a good person can you be very evil onscreen’",
        "What to watch while you're home? Enjoy these Latino-themed shows.",
        "Lorenzo Sanz: The president of La Septima",
        "Is Jovic ready to get back on track like Modric, Courtois and Casemiro?",
        "Uneasy rider: From Tierra del Fuego to Alaska on a motorbike",
        "Factbox: Coronavirus deaths pass 5,400 worldwide",
        "Will spring breakers become super-spreaders?",
        "Covid-19: Spain death toll rises to over 1,300",
        "Under quarantine, media is actually social",
        "'It's been absolute hell, quite frankly': Life as a travel agent during COVID-19",
        "Portugal's death toll from coronavirus doubles to 12",
        "Angola confirms first cases as coronavirus spreads over Africa",
        "Angola confirms first cases as coronavirus spreads over Africa",
        "Factbox: Coronavirus deaths pass 5,400 worldwide",
        "Factbox: Sports events around the world hit by coronavirus pandemic",
        "Factbox: Sports events around the world hit by coronavirus pandemic",
        "Sports events around the world hit by coronavirus pandemic",
        "Emery on Serie A links, Juve and Ramsey",
        "Bundesliga Standings",
        "Three Portsmouth players test positive for coronavirus",
        "Eredivisie Standings",
        "Ligue 1 Standings",
        "Factbox: Sports events around the world hit by coronavirus pandemic",
        "Factbox: Sports events around the world hit by coronavirus pandemic",
        "Sports events around the world hit by coronavirus pandemic"
    ],
    "2020-03-22": [
        "Show and tell: Cristiano Ronaldo teaches kids to wash hands as star 'set to join fight against Covid-19' (VIDEO)",
        "Nuno Espirito Santo: What makes Wolves boss one of Europe's leading managers?",
        "RPT-INSIGHT-Whatever it takes: ventilator industry enlists army in battle to save lives",
        "Portugal to repatriate passengers of cruise ship from Brazil",
        "Portugal to repatriate passengers of cruise ship from Brazil",
        "Nuno Espirito Santo: What makes Wolves boss one of Europe's leading managers?",
        "Felipe is Atletico Madrid's iron man",
        "Who makes Real Madrid's flop XI of the 21st century?",
        "News24.com | Club in Port Elizabeth fined for selling alcohol after 18:00 restriction - report",
        "Nuno Espirito Santo: What makes Wolves boss one of Europe's leading managers?",
        "Angola, Eritrea, Uganda confirm first cases as coronavirus spreads in Africa",
        "Show and tell: Cristiano Ronaldo teaches kids to wash hands as star 'set to join fight against Covid-19' (VIDEO)",
        "Remaining Juventus team including Cristiano Ronaldo test NEGATIVE for coronavirus despite fears after three infections – report",
        "Coronavirus: A couple, a campervan and a baby",
        "News24.com | Coronavirus cases reach 274",
        "Wolves defender Ruben Vinagre hails 'big impact' of Bruno Fernandes since arriving at Manchester United",
        "Portugal to repatriate passengers of cruise ship from Brazil",
        "Why I canceled my wedding",
        "Portugal to repatriate passengers of cruise ship from Brazil",
        "Spain to restrict entry for 30 days over coronavirus",
        "Spain to restrict entry for 30 days over coronavirus",
        "Nuno Espirito Santo: What makes Wolves boss one of Europe's leading managers?",
        "Bordalas: 'Inter symbol of Serie A'",
        "Former Real Madrid president Lorenzo Sanz, who presided over double Champions League glory, dies after contracting coronavirus"
    ],
    "2020-03-23": [
        "Which players make your Premier League Hall of Fame?",
        "'No limits' to euro zone's coronavirus response, Eurogroup chief says",
        "All in the Game: Getting to the bottom of Wembley’s massive lasagne",
        "ECB's Costa calls for 'coronabonds' to prevent new euro debt crisis",
        "In leaked memo, Hobby Lobby refuses to give workers paid sick leave during coronavirus pandemic",
        "Home quarantine no option for thousands in Philippines",
        "Dillian Whyte still training for doubtful Alexander Povetkin bout despite coronavirus restrictions",
        "'No limits' to euro zone's coronavirus response, Eurogroup chief says",
        "The U.S. Military's Behind-the-Scenes Moves To Protect Nuclear Readiness Amid Coronavirus",
        "Dillian Whyte drives 40 hours to Portugal for heavyweight clash with Alexander Povetkin which could be postponed",
        "Europe considers 'Corona Bonds' as a way to pay for coronavirus crisis",
        "'Proud to be Canadian': Forgoing 2020 Olympics bittersweet, but the right thing to do, Man. athletes say",
        "Manchester United: Bryan Robson lauds Bruno Fernandes 'leadership' and influence on teammates",
        "Despite uncertainty, Sathiyan confident of booking Olympic berth",
        "Sports events around the world hit by coronavirus pandemic",
        "Sill soldier forges his way to finer things",
        "ECB's Costa calls for 'coronabonds' to prevent new euro debt crisis",
        "Home quarantine no option for thousands in Philippines",
        "Sports events around the world hit by coronavirus pandemic",
        "Champions League, Europa League Finals Postponed Indefinitely Due to Coronavirus",
        "Coronavirus: Uefa postpones European club finals",
        "La Liga Postponed Indefinitely Due to Coronavirus Until Government Clearance",
        "UEFA formally postpones Champions League final amid shutdown",
        "UEFA postpone European club finals",
        "UEFA postpones club Finals",
        "Mikel Arteta: Arsenal manager says he has recovered from coronavirus",
        "UEFA formally postpones Champions League, Europa League final",
        "Hudson-Odoi recovers from coronavirus",
        "Aberdeen chairman Dave Cormack warns of tough times ahead due to coronavirus",
        "Belarusian Premier League keeps playing soccer: 'It's like no one cares' about coronavirus",
        "Coronavirus: Champions League final postponed by Uefa",
        "UEFA postpone Champions League and Europa League finals indefinitely",
        "Mikel Arteta confirms recovery from coronavirus",
        "Uefa postpone European club finals but no new dates set",
        "Coronavirus: Uefa postpone European club finals but no new dates set",
        "Sports events around the world hit by coronavirus pandemic",
        "Arsenal manager Mikel Arteta feeling 'very well' after recovering from coronavirus",
        "UEFA formally postpones Champions League final amid shutdown",
        "Coronavirus: Gary Neville outlines concerns over Premier League games being played behind closed doors"
    ],
    "2020-03-24": [
        "An online lifeline in Portugal for old ventilators amid coronavirus crisis",
        "COVID-19 chaos: MSC Fantasia passengers 'kept in the dark' until day of disembarkation",
        "Terrence McNally, acclaimed playwright, has died at age 81",
        "Cristiano Ronaldo, Agent Jorge Mendes Donate €1M Toward Coronavirus Relief",
        "Terrence McNally, Tony-winner for Ragtime and Kiss of the Spider Woman, dead at 81",
        "Cristiano Ronaldo donates lifesaving medical equipment to hospitals in Portugal",
        "Jorge Jesus snaps at journalists: You should've caught the virus",
        "Multiple Tony-winning playwright Terrence McNally dies at 81",
        "Volunteers sew masks for health workers facing shortages",
        "Volunteers sew masks for health workers facing shortages",
        "Volunteers sew masks for health workers facing shortages",
        "Multiple Tony-winning playwright Terrence McNally dies at 81",
        "Tony-Winning Playwright Terrence McNally Dies of Coronavirus Complications",
        "Multiple Tony-Winning Playwright Terrence McNally Dies At 81 Of Complications From Coronavirus",
        "10 welterweights you can expect to see on Dana White's Contender Series, Season 4",
        "Cristiano Ronaldo, Agent Jorge Mendes Donate €1M Toward Coronavirus Relief",
        "Cristiano Ronaldo donates lifesaving medical equipment to hospitals in Portugal",
        "Could Diogo Jota become a target for Atletico Madrid?",
        "Lionel Messi, Diego Maradona and why the brilliance of the true greats will forever echo down the ages",
        "England '66, Man Utd '99, Arsenal '04 - the iconic starting XIs who rarely played together",
        "With lower bandwidth, Disney+ opens streaming service in UK, Ireland, 5 other European countries, France to come online April 7",
        "An online lifeline in Portugal for old ventilators amid coronavirus crisis",
        "Cristiano Ronaldo gives Portugal hospitals equipment to fight coronavirus",
        "Cristiano Ronaldo, Agent Jorge Mendes Donate €1M Toward Coronavirus Relief",
        "B/R Football Ranks: When Did Football's Elite Fowards Hit the Peaks?",
        "COVID-19 chaos: MSC Fantasia passengers 'kept in the dark' until day of disembarkation",
        "Cristiano Ronaldo donates lifesaving medical equipment to hospitals in Portugal",
        "Jorge Jesus snaps at journalists: You should've caught the virus",
        "25th Anniversary of Europe Abolishing Borders Will be Marked With Closed Borders",
        "For a global movement with a radical agenda",
        "National Olympic Committees 'clearly upped the ante' in pushing for postponement of Tokyo Games",
        "Odion Ighalo: Manchester United striker could leave before season ends with loan set to expire",
        "Tokyo 2020: Team GB set to back calls for Olympics to be postponed as BOA, British Paralympic Association and UK Sport meet",
        "Report: Roma want permanent deal for Mkhi",
        "Report: Roma want permanent deal for Mkhitaryan",
        "Man Utd striker Ighalo faces uncertain future",
        "Ross McCrorie becomes fifth Portsmouth player to test positive for coronavirus",
        "Who is Atletico Madrid's best goalkeeper of all time?",
        "Manchester United could lose Odion Ighalo if season runs into June",
        "Mexican president: Coronavirus bailout will help poor, not major companies",
        "Europe unable to reach deal on new coronavirus aid as long-held tensions resurface",
        "From contract disputes to sponsorships, why football's legal problems will be laid bare on 30 June",
        "Ronaldo & Messi to play in Belarus? Star says Europe's only operating football league may attract elite"
    ],
    "2020-03-25": [
        "Sport stars rally to donate money amid coronavirus pandemic",
        "Satellite images show airports, ports, and highways left deserted as the world faces coronavirus social distancing and lockdowns",
        "More than 100 startups in Portugal are helping fight COVID-19 and it's a model other countries can follow",
        "With Terrence McNally’s death, the theater has lost a voice of consummate wit and passion - The Washington Post",
        "Ryanair to fly limited service over the next week",
        "Federer donates 1m Swiss francs to help 'most vulnerable families in Switzerland'",
        "Every Sports Star Who Has Donated Money to Combat Coronavirus Around the World",
        "Cristiano Ronaldo, agent donate intensive care units to Portuguese hospitals",
        "Ryanair to operate limited flights from Cork and Dublin",
        "Coronavirus: Ryanair to run limited flights from Cork and Dublin",
        "Cristiano Ronaldo and Jorge Mendes donation to fight coronavirus worth £1m and enable three new intensive care units to be built",
        "Cristiano Ronaldo and Lionel Messi donate to hospitals in fight against coronavirus",
        "Coronavirus symptoms: Your questions about COVID-19 answered",
        "More than 100 startups in Portugal are helping fight COVID-19 and it's a model other countries can follow",
        "Sport stars rally to donate money amid coronavirus pandemic",
        "Federer donates 1m Swiss francs to help 'most vulnerable families in Switzerland'",
        "Every Sports Star Who Has Donated Money to Combat Coronavirus Around the World",
        "Cristiano Ronaldo and Jorge Mendes donation to fight coronavirus worth £1m and enable three new intensive care units to be built",
        "Cristiano Ronaldo, agent donate intensive care units to Portuguese hospitals",
        "When coronavirus disappears, football will return in search of its champions",
        "Cristiano Ronaldo and Lionel Messi donate to hospitals in fight against coronavirus",
        "Bronze's journey from sibling rivalry to cutting pizzas to World Cups - in her own words",
        "More than 100 startups in Portugal are helping fight COVID-19 and it's a model other countries can follow",
        "Paris 2020 organisers remain hopeful European Championships will take place",
        "Satellite images show airports, ports, and highways left deserted as the world faces coronavirus social distancing and lockdowns",
        "Sport stars rally to donate money amid coronavirus pandemic",
        "Roger Federer donates $1 MILLION to vulnerable families affected by coronavirus",
        "2020 Global Forecast for Home Security System - High Tech & Emerging Markets Report - ResearchAndMarkets.com - Associated Press",
        "Cosplays em Animal Crossing: New Horizons",
        "Call for EU to issue 'coronabonds' for member states",
        "Federer donates one million Swiss Francs to vulnerable families",
        "Federer donates 1m Swiss francs to help 'most vulnerable families in Switzerland'",
        "Europe has relied on Turkey to stem another migration crisis. That plan backfired.",
        "Italy, Austria and UK account for most imported cases of Covid-19",
        "Coronavirus: Italy, Austria and UK account for most imported cases",
        "Some fitness influencers say a surge in sales of direct-to-consumer workout services has protected their incomes, as brand deals slump amid the coronavirus pandemic",
        "Cristiano Ronaldo, agent donate intensive care units to Portuguese hospitals",
        "Federer donates one million Swiss Francs to vulnerable families",
        "Cristiano Ronaldo and Jorge Mendes donation to fight coronavirus worth £1m and enable three new intensive care units to be built",
        "Former Juventus president: Cristiano only appears to be taking pictures by the pool",
        "Nine European countries say it is time for 'corona bonds' as virus death toll rises",
        "Mexico will receive cruise ships, but fumigate passengers",
        "Steven Davis: Rangers midfielder against games being played behind closed doors",
        "Mexico will receive cruise ships, but fumigate passengers",
        "The 21 best PC games on Xbox Game Pass for PC right now (March 2020)"
    ],
    "2020-03-26": [
        "Neanderthals feasted on seafood and nuts according to fossil remains",
        "Friday's gossip column: Haaland, Ighalo, Pogba, Pedro, Gabriel",
        "Lisbon's first 'drive-thru' clinic tests patients for coronavirus",
        "Multiple Tony-winning playwright Terrence McNally dies at 81",
        "Portugal announces new measures to help firms, families through coronavirus crisis",
        "Escape from Peru: Within seconds, my flight jumped from €750 to €4,500",
        "Valencia's 30 most promising youngsters at the start of the decade: Where are they now?",
        "Lisbon's first 'drive-thru' clinic tests patients for coronavirus",
        "Roger Federer, Lionel Messi & Cristiano Ronaldo - Sportspersons Are Donating To Help Fight Coronavirus",
        "The top 10 transfer stories of the day: Barcelona want Ndombele",
        "Mark Blum, actor de Broadway, cine y series como You, murió de coronavirus",
        "Neanderthals ate sharks and dolphins",
        "10 things in tech you need to know today",
        "Neanderthals feasted on seafood and nuts according to fossil remains",
        "Lisbon's first 'drive-thru' clinic tests patients for coronavirus",
        "Zomato sets up funds for daily wage workers",
        "EU marks 25th anniversary of open-border Schengen pact with closed frontiers",
        "Coronavirus: The sports turning to gaming during lockdown",
        "The Sunday Crossword No. 3093",
        "Coronavirus: Rafael Nadal urges Spain's athletes to raise €11m to help fight against pandemic",
        "Coronavirus update: China to close borders in bid to stop reinfection",
        "Europe's open borders turn 25 today, but coronavirus has put a stop to that",
        "Showdown over eurobonds looms in EU",
        "World leaders wrestle to contain pandemic’s economic fallout",
        "Valencia's 30 most promising youngsters at the start of the decade: Where are they now?",
        "Portugal announces new measures to help firms, families through coronavirus crisis",
        "On keeping your distance",
        "EU marks 25th anniversary of open-border Schengen pact with closed frontiers",
        "Covid-19: Global infections now exceed 490,000",
        "'I miss hugging the people I love' - Arteta on coronavirus recovery",
        "Uva: 'Impossible to set a date'",
        "Who is the best right-back in Atletico Madrid's history?",
        "Real Betis expect to finish the season, even in July",
        "Ostersunds and why the transfer window is vital for clubs to survive coronavirus crisis",
        "Soccer-Arteta feared infecting Arsenal team during coronavirus scare"
    ],
    "2020-03-27": [
        "Neanderthals ate dolphins and seals, researchers reveal",
        "Factbox: Latest on the spread of the coronavirus around the world",
        "Care homes in Portugal fear they will be ravaged by coronavirus",
        "Tendulkar, Dhoni donate to fight coronavirus",
        "EU tempers fray as virus hits lives, livelihoods, economies",
        "New movies to stream this week: ‘Resistance,’ ‘Bacurau’ and more",
        "Care homes in Portugal fear they will be ravaged by coronavirus",
        "Coronavirus Fears Spark Prison Strikes, Protests, and Riots Around the World",
        "Care homes in Portugal fear they will be ravaged by coronavirus",
        "Neanderthals ate dolphins and seals, researchers reveal",
        "Coronavirus: How managers, players and sporting directors are coping",
        "Europe needs new measures to tackle coronavirus threat: Italian president",
        "We need to act, ECB's Lagarde tells feuding EU on coronavirus rescue: sources",
        "Tendulkar, Dhoni donate to fight coronavirus",
        "Rooney stars, England on march & the fab four - BBC Sport to show classic Euro 2004 match",
        "Claire Emslie: Scotland cap on Melbourne City success & adapting at home",
        "Neanderthals didn't just hunt mammoths. They actually knew how to fish, researchers discover.",
        "EXPLAINER-Euro zone options for economic support amid coronavirus pandemic",
        "Factbox: Sports events around the world hit by coronavirus pandemic",
        "Doncic: The day I met Cristiano Ronaldo I couldn't even talk",
        "Italy's coronavirus death toll tops 8,000 as EU leaders fail to present new stimulus",
        "Covid-19: Economic downturn worsens old EU splits",
        "EU divisions laid bare as bloc feuds over coronavirus rescue",
        "Coronavirus: Irish off-licences that offer collection and delivery during the shutdown",
        "'The only certainty is the uncertainty' - what next for football?",
        "Coronavirus: What is it like to play behind closed doors?",
        "Aberdeen: Wage cuts not inevitable, says chairman Dave Cormack",
        "Manchester United to offer refunds, season ticket delay to fans",
        "Cruise ships are still scrambling for safe harbor",
        "Factbox: Sports events around the world hit by coronavirus pandemic",
        "Mikel Arteta feared infecting Arsenal team during coronavirus scare",
        "Aubameyang for Arsenal, Henderson for Liverpool, Kovacic for Chelsea… every Premier League club’s standout sta - talkSPORT.com",
        "How the coronavirus has hit global sport"
    ],
    "2020-03-28": [
        "Portugal to treat migrants as residents during coronavirus crisis",
        "Juventus, Players Agree to Salary Reductions That Could Save $100.3M",
        "The curse that haunts Militao at Real Madrid",
        "Juventus, Players Agree to Salary Reductions That Could Save $100.3M",
        "A journey through the Americas: Is this the end of the road?",
        "Portugal to treat migrants as residents during coronavirus crisis",
        "Juventus players and Maurizio Sarri agree coronavirus pay freeze",
        "France and allies establish new task force in Sahel",
        "Coronavirus cradle Wuhan partly reopens after lockdown",
        "How Spain became a hotspot for coronavirus",
        "A global guide to combating the coronavirus",
        "Solidarity from two metres away",
        "There are still more than 2500 Australians trapped on cruise ships. There's no magic wand to bring them home",
        "Clocks go forward one hour on Sunday morning",
        "Coronavirus: Portugal to treat migrants as residents during pandemic",
        "Five more crazy days on Wall Street drag markets back from brink",
        "Covid-19: Why the EU is haunted by the euro crisis",
        "Evidence debunks myth that Ponce de Leon discovered Florida",
        "Mubi: online repertory cinema for a handful of change",
        "‘Coronabonds’ row could endanger the European project",
        "4 Ways China Gains from the Coronavirus Pandemic",
        "Uefa boss admits season 'will probably be lost' if coronavirus crisis continues beyond end of June",
        "Percassi: 'Bergamo never give up'",
        "Who is the best left-back in Atletico Madrid's history?",
        "Ceferin: There are three plans, but nothing will be like it was before",
        "Manchester United back where they started after a year under Ole Gunnar Solskjaer"
    ]
}